src/cf/Catalogs/СоответствиеПолейЗагрузкиДанныхИзВнешнегоИсточника.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>СоответствиеПолейЗагрузкиДанныхИзВнешнегоИсточника</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектЗагрузки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяТабличнойЧасти</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоставляемаяНастройка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПоставляемогоЭлемента</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияПоставляемойНастройки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Недействителен</Name>
					<Comment>АПК:58</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоответствияПолей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерКолонки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяПоля</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеПоля</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДополнительныйРеквизит</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПорядокПоиска</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПолеПоиска</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Использовать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/СоответствиеПолейЗагрузкиДанныхИзВнешнегоИсточника/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполнить настройки полей.
// 
// Параметры:
//  НоваяНастройка - Строка - Новая настройка
//  ПроверятьНастройку - Булево - Проверять настройку
Процедура ЗаполнитьНастройкиПолей(НоваяНастройка, ПроверятьНастройку = Истина) Экспорт
	
	Если ПроверятьНастройку Тогда

		Если НастройкаПоставляемаяСоответствуетТекущей() Тогда
			
			ЗаполнитьСоответствияПолейНастройкой(НоваяНастройка);

		КонецЕсли;
		
	Иначе

		ЗаполнитьСоответствияПолейНастройкой(НоваяНастройка);

	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти	
	
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Перем ПолныйПутьОбъектЗагрузки;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		
		ДанныеЗаполнения.Свойство("ОбъектЗагрузки", ОбъектЗагрузки);
		ДанныеЗаполнения.Свойство("ИмяТабличнойЧасти", ИмяТабличнойЧасти);
		ДанныеЗаполнения.Свойство("ПолныйПутьОбъектЗагрузки", ПолныйПутьОбъектЗагрузки);
		
		ПолныйПутьОбъектЗагрузки = ?(ПолныйПутьОбъектЗагрузки = Неопределено, "", ПолныйПутьОбъектЗагрузки);
		
		ВыбранныеПоля = Неопределено;
		Если ДанныеЗаполнения.Свойство("ВыбранныеПоля", ВыбранныеПоля) Тогда
			
			Если ТипЗнч(ВыбранныеПоля) = Тип("Соответствие") Тогда
				
				ДоступныеПоляЗагрузкиДанных = Справочники.СоответствиеПолейЗагрузкиДанныхИзВнешнегоИсточника.ДоступныеПоляЗагрузкиДанныхИзВнешнегоИсточника(
					ОбъектЗагрузки, ИмяТабличнойЧасти, Истина, ПолныйПутьОбъектЗагрузки);
				Для каждого ЭлементСоответствия Из ВыбранныеПоля Цикл
					
					Если ТипЗнч(ЭлементСоответствия.Ключ) = Тип("Строка") И ДоступныеПоляЗагрузкиДанных.Свойство(
						ЭлементСоответствия.Ключ) Тогда
						
						ОписаниеПоля = ДоступныеПоляЗагрузкиДанных[ЭлементСоответствия.Ключ];
						
					Иначе
						
						ОписаниеПоля = Строка(ЭлементСоответствия.Ключ);
						
					КонецЕсли;
					
					Если ОписаниеПоля = Неопределено Тогда
						
						Продолжить;
						
					КонецЕсли;
					
					НоваяСтрока = СоответствияПолей.Добавить();
					НоваяСтрока.НомерКолонки		= ЭлементСоответствия.Значение;
					НоваяСтрока.ПредставлениеПоля	= ОписаниеПоля;
					
					Если ТипЗнч(ЭлементСоответствия.Ключ) = Тип("Строка") Тогда
						
						НоваяСтрока.ИмяПоля = ЭлементСоответствия.Ключ;
						
					Иначе
						
						НоваяСтрока.ДополнительныйРеквизит = ЭлементСоответствия.Ключ;
						
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НастройкаПоставляемаяСоответствуетТекущей()
	
	Если СоответствияПолей.Количество() = 0 Тогда
		Возврат Истина;
	КонецЕсли;

	ТаблицаПоставляемойНастройки = Справочники.СоответствиеПолейЗагрузкиДанныхИзВнешнегоИсточника.НастройкуВТаблицу(
		ПоставляемаяНастройка);
		
	ТаблицаТекущейНастройки = СоответствияПолей.Выгрузить();
	ТаблицаТекущейНастройки.Сортировать("НомерКолонки");
	
	Для Каждого ПоставляемаяСтрока Из ТаблицаПоставляемойНастройки Цикл
		
		ТекущаяСтрока = ТаблицаТекущейНастройки.Найти(ПоставляемаяСтрока.НомерКолонки, "НомерКолонки");
		Если ТекущаяСтрока = Неопределено Тогда
			Возврат Ложь;
		КонецЕсли;
		
		Если ПоставляемаяСтрока.ИмяПоля <> ТекущаяСтрока.ИмяПоля
			Или ПоставляемаяСтрока.ПредставлениеПоля <> ТекущаяСтрока.ПредставлениеПоля Тогда
				
				Возврат Ложь;
				
		КонецЕсли;
		
	КонецЦикла;
	 
	Возврат Истина;
	
КонецФункции

Процедура ЗаполнитьСоответствияПолейНастройкой(ПоставляемаяНастройка)
	
	ТаблицаПоставляемойНастройки = Справочники.СоответствиеПолейЗагрузкиДанныхИзВнешнегоИсточника.НастройкуВТаблицу(
		ПоставляемаяНастройка);
		
	СоответствияПолей.Загрузить(ТаблицаПоставляемойНастройки);	
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
